# DataFrame创建

# DataFrame创建

In [119]:
import pandas as pd
import numpy as np

s1=pd.Series([1,2,3,4,5])
s2=pd.Series([6,7,8,9,10])
df=pd.DataFrame({"First":s1,"Second":s2})
df

   First  Second
0      1       6
1      2       7
2      3       8
3      4       9
4      5      10

In [120]:
df=pd.DataFrame({
    "id":[1,2,3,4,5],
    "name":["A","B","C","D","E"],
    "age":[11,12,13,14,15],
    "score":[16,17,18,19,20]
},index=[1,2,3,4,5])
df

   id name  age  score
1   1    A   11     16
2   2    B   12     17
3   3    C   13     18
4   4    D   14     19
5   5    E   15     20

In [121]:
df=pd.DataFrame({
    "id":[1,1,2,3,4,5,6],
    "name":["A","A","B","C","D","E",'F'],
    "age":[11,11,12,13,14,15,19],
    "score":[16,16,17,18,19,20,16]
},index=[1,2,3,4,5,6,7],columns=["id","name","score","age"])
df

   id name  score  age
1   1    A     16   11
2   1    A     16   11
3   2    B     17   12
4   3    C     18   13
5   4    D     19   14
6   5    E     20   15
7   6    F     16   19

# DataFrame的属性

In [122]:
print("行索引：")
print(df.index)
print("列标签")
print(df.columns)
print("值")
print(df.values)

行索引：
Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')
列标签
Index(['id', 'name', 'score', 'age'], dtype='object')
值
[[1 'A' 16 11]
 [1 'A' 16 11]
 [2 'B' 17 12]
 [3 'C' 18 13]
 [4 'D' 19 14]
 [5 'E' 20 15]
 [6 'F' 16 19]]

In [123]:
print('维度',df.ndim)
print("形状:",df.shape)
print('个数',df.size)
print('数据类型:',df.dtypes)

维度 2
形状: (7, 4)
个数 28
数据类型: id        int64
name     object
score     int64
age       int64
dtype: object

In [124]:
print(df.T)

        1   2   3   4   5   6   7
id      1   1   2   3   4   5   6
name    A   A   B   C   D   E   F
score  16  16  17  18  19  20  16
age    11  11  12  13  14  15  19

In [125]:
df

   id name  score  age
1   1    A     16   11
2   1    A     16   11
3   2    B     17   12
4   3    C     18   13
5   4    D     19   14
6   5    E     20   15
7   6    F     16   19

In [126]:
#获取元素  loc iloc at iat
df.loc[2]

id        1
name      A
score    16
age      11
Name: 2, dtype: object

In [127]:
df.iloc[1]

id        1
name      A
score    16
age      11
Name: 2, dtype: object

In [128]:
print(df.loc[:,'name'])

1    A
2    A
3    B
4    C
5    D
6    E
7    F
Name: name, dtype: object

In [129]:
print(df.iloc[:,1])

1    A
2    A
3    B
4    C
5    D
6    E
7    F
Name: name, dtype: object

In [130]:
print(df.at[2,'name'])

A

In [131]:
print(df.iat[1,1])

A

# 访问方式

In [132]:
#获取单列数据
print(df['name'])

1    A
2    A
3    B
4    C
5    D
6    E
7    F
Name: name, dtype: object

In [133]:
print(df.name)

1    A
2    A
3    B
4    C
5    D
6    E
7    F
Name: name, dtype: object

In [134]:
#多列数据
print(df[['id','name']])

   id name
1   1    A
2   1    A
3   2    B
4   3    C
5   4    D
6   5    E
7   6    F

In [135]:
print(df.head(2))

   id name  score  age
1   1    A     16   11
2   1    A     16   11

In [136]:
print(df.tail(2))

   id name  score  age
6   5    E     20   15
7   6    F     16   19

In [137]:
df

   id name  score  age
1   1    A     16   11
2   1    A     16   11
3   2    B     17   12
4   3    C     18   13
5   4    D     19   14
6   5    E     20   15
7   6    F     16   19

In [138]:
df[df.score>18]

   id name  score  age
5   4    D     19   14
6   5    E     20   15

In [139]:
df[(df.score>18)&(df.age>14)]

   id name  score  age
6   5    E     20   15

In [140]:
# 随机抽样
df.sample(3)

   id name  score  age
5   4    D     19   14
1   1    A     16   11
7   6    F     16   19

In [141]:
print(df.isin(['B',15])) # 查看元素是否包含

      id   name  score    age
1  False  False  False  False
2  False  False  False  False
3  False   True  False  False
4  False  False  False  False
5  False  False  False  False
6  False  False  False   True
7  False  False  False  False

In [142]:
print(df.isna())

      id   name  score    age
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False
6  False  False  False  False
7  False  False  False  False

In [143]:
print(df['score'].sum())
print(df['score'].max())
print(df['age'].min())
print(df['score'].mean())
print(df['score'].median())
print(df['score'].mode())

122
20
11
17.428571428571427
17.0
0    16
Name: score, dtype: int64

In [144]:
print(df.score.std())
print(df.score.var())
print(df.score.quantile(0.25))

1.618347187425374
2.619047619047619
16.0

In [145]:
print(df.describe())

             id      score        age
count  7.000000   7.000000   7.000000
mean   3.142857  17.428571  13.571429
std    1.951800   1.618347   2.819997
min    1.000000  16.000000  11.000000
25%    1.500000  16.000000  11.500000
50%    3.000000  17.000000  13.000000
75%    4.500000  18.500000  14.500000
max    6.000000  20.000000  19.000000

In [146]:
print(df.count()) # 每一列非缺的个数

id       7
name     7
score    7
age      7
dtype: int64

In [147]:
print(df.value_counts())

id  name  score  age
1   A     16     11     2
2   B     17     12     1
3   C     18     13     1
4   D     19     14     1
5   E     20     15     1
6   F     16     19     1
Name: count, dtype: int64

In [148]:
print(df.drop_duplicates())

   id name  score  age
1   1    A     16   11
3   2    B     17   12
4   3    C     18   13
5   4    D     19   14
6   5    E     20   15
7   6    F     16   19

In [149]:
print(df.duplicated())

1    False
2     True
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [150]:
print(df.duplicated(subset=['score']))

1    False
2     True
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [151]:
df.sample(4)

   id name  score  age
6   5    E     20   15
7   6    F     16   19
1   1    A     16   11
3   2    B     17   12

In [152]:
df.replace(11,110)

   id name  score  age
1   1    A     16  110
2   1    A     16  110
3   2    B     17   12
4   3    C     18   13
5   4    D     19   14
6   5    E     20   15
7   6    F     16   19

In [153]:
df

   id name  score  age
1   1    A     16   11
2   1    A     16   11
3   2    B     17   12
4   3    C     18   13
5   4    D     19   14
6   5    E     20   15
7   6    F     16   19

In [154]:
df.cumsum()

   id     name  score  age
1   1        A     16   11
2   2       AA     32   22
3   4      AAB     49   34
4   7     AABC     67   47
5  11    AABCD     86   61
6  16   AABCDE    106   76
7  22  AABCDEF    122   95

In [156]:
print(df.sort_index(ascending=False))

   id name  score  age
7   6    F     16   19
6   5    E     20   15
5   4    D     19   14
4   3    C     18   13
3   2    B     17   12
2   1    A     16   11
1   1    A     16   11

In [161]:
print(df.sort_values(by=['score','age'],ascending=[True,False]))

   id name  score  age
7   6    F     16   19
1   1    A     16   11
2   1    A     16   11
3   2    B     17   12
4   3    C     18   13
5   4    D     19   14
6   5    E     20   15

In [162]:
df.nlargest(2,columns=['score','age'])

   id name  score  age
6   5    E     20   15
5   4    D     19   14

In [163]:
df.nsmallest(2,columns=['score','age'])

   id name  score  age
1   1    A     16   11
2   1    A     16   11